app/controllers/comments_controller.rb

	def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.create(params[:comment])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 2 LIMIT 1
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES ('Sarah Kelley', 'Yeah, I like it too. . .', 2, '2011-05-16 01:11:40.690940', '2011-05-16 01:11:40.690940')