app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("name", "title", "content", "created_at", "updated_at") VALUES ('Robert Kelley', 'Ruby on Rails', 'I love Ruby on Rails, now I just have to figure out how all of it works.', '2011-05-16 00:37:50.590973', '2011-05-16 00:37:50.590973')